// NOTE: Сортировка будет работать только 
// после внедрения своего onSort обработчика
// и хранения текущего состояния в своем контейнере
const dataModel = [
    // Сортируемое поле
    { field: 'first_name', fieldName: 'Имя', canSort: true, width: 200 },
    // Обычное, не сортируемое
    { field: 'last_name', fieldName: 'Фамилия', width: 200 },
]

// ---------------------------------------------------------------

// FIXME: fix reference-link

export type DefaultItem = any;

// ---------------------------------------------------------------

// FIXME: more strict
it('shouldn\'t react on something', () => {
    expect(...).toBeTruth();
})

// ---------------------------------------------------------------

// FIXME: remove scroll bar after dataModel fetched? (step-by-step loading...)
// FIXME: optimize? (loading, scrolled, sorted, ...) // for example: isScrolled -> header
const shouldUpdate = (
    flag1 ||
    flag2 ||
    computeFlag3()
);

// ---------------------------------------------------------------

// FIXME: specify redirect urls?
const login = (token: string) => {
    setToken(token);
    window.location.href = "/";
};

// ---------------------------------------------------------------
// ---------------------------------------------------------------
// ---------------------------------------------------------------
// ---------------------------------------------------------------
// ---------------------------------------------------------------
// ---------------------------------------------------------------
// ---------------------------------------------------------------